Repository: digaomatias/mymascada
Catalog: src/WebAPI/MyMascada.WebAPI/Resources/Business/BusinessMessages.*.resx
Languages: pt_br

source: Account not found
pt_br: Conta nao encontrada

# Account.NotAccessible
source: You don't have access to this account
pt_br: Voce nao tem acesso a esta conta

# Account.HasTransactions
source: Cannot delete account that has transactions. Please delete or move all transactions first.
pt_br: Nao e possivel excluir conta que possui transacoes. Por favor, exclua ou mova todas as transacoes primeiro.

# Account.AlreadyArchived
source: Account is already archived
pt_br: A conta ja esta arquivada

source: Category not found
pt_br: Categoria nao encontrada

# Category.NotAccessible
source: You don't have permission to access this category
pt_br: Voce nao tem permissao para acessar esta categoria

# Category.ParentNotFound
source: Parent category not found or not accessible
pt_br: Categoria pai nao encontrada ou inacessivel

# Category.HasTransactions
source: Cannot delete category that has transactions. Please reassign or delete all transactions in this category first.
pt_br: Nao e possivel excluir categoria que possui transacoes. Por favor, reatribua ou exclua todas as transacoes desta categoria primeiro.

# Category.HasSubcategories
source: Cannot delete category that has subcategories. Please delete or move all subcategories first.
pt_br: Nao e possivel excluir categoria que possui subcategorias. Por favor, exclua ou mova todas as subcategorias primeiro.

# Category.CircularReference
source: This parent assignment would create a circular reference
pt_br: Esta atribuicao de categoria pai criaria uma referencia circular

# Category.SelfParent
source: A category cannot be its own parent
pt_br: Uma categoria nao pode ser pai de si mesma

# Category.CannotDeleteDefault
source: Cannot delete the default category
pt_br: Nao e possivel excluir a categoria padrao

source: Transaction not found
pt_br: Transacao nao encontrada

# Transaction.NotAccessible
source: You don't have access to this transaction
pt_br: Voce nao tem acesso a esta transacao

# Transaction.AlreadyCategorized
source: Transaction is already categorized
pt_br: A transacao ja esta categorizada

# Transaction.IsPartOfTransfer
source: Cannot modify this transaction directly as it is part of a transfer
pt_br: Nao e possivel modificar esta transacao diretamente pois faz parte de uma transferencia

source: Transfer not found
pt_br: Transferencia nao encontrada

# Transfer.SourceNotFound
source: Source account not found
pt_br: Conta de origem nao encontrada

# Transfer.DestinationNotFound
source: Destination account not found
pt_br: Conta de destino nao encontrada

# Transfer.SameAccount
source: Cannot transfer to the same account
pt_br: Nao e possivel transferir para a mesma conta

# Transfer.InsufficientFunds
source: Insufficient funds in source account
pt_br: Saldo insuficiente na conta de origem

# Rule.NotFound
source: Categorization rule not found
pt_br: Regra de categorizacao nao encontrada

# Rule.NotAccessible
source: You don't have access to this rule
pt_br: Voce nao tem acesso a esta regra

# Rule.DuplicateName
source: A rule with this name already exists
pt_br: Ja existe uma regra com este nome

# Rule.InvalidPattern
source: Invalid pattern format
pt_br: Formato de padrao invalido

# Auth.InvalidCredentials
source: Invalid email or password
pt_br: E-mail ou senha invalidos

# Auth.AccountLocked
source: Account is locked. Please try again later.
pt_br: Conta bloqueada. Por favor, tente novamente mais tarde.

# Auth.EmailNotConfirmed
source: Please confirm your email address before signing in
pt_br: Por favor, confirme seu endereco de e-mail antes de entrar

# Auth.EmailAlreadyExists
source: An account with this email already exists
pt_br: Ja existe uma conta com este e-mail

# Auth.UsernameAlreadyExists
source: This username is already taken
pt_br: Este nome de usuario ja esta em uso

# Auth.InvalidResetToken
source: Invalid or expired password reset link
pt_br: Link de redefinicao de senha invalido ou expirado

# Auth.TooManyResetRequests
source: Too many password reset requests. Please try again later.
pt_br: Muitas solicitacoes de redefinicao de senha. Por favor, tente novamente mais tarde.

# Import.InvalidFile
source: Invalid file format
pt_br: Formato de arquivo invalido

# Import.NoTransactionsFound
source: No transactions found in the file
pt_br: Nenhuma transacao encontrada no arquivo

# Import.DuplicatesDetected
source: Some transactions appear to be duplicates
pt_br: Algumas transacoes parecem ser duplicadas

# Import.ProcessingFailed
source: Failed to process the import file
pt_br: Falha ao processar o arquivo de importacao

source: Bank connection not found
pt_br: Conexao bancaria nao encontrada

# BankConnection.SyncFailed
source: Failed to sync with bank. Please try again later.
pt_br: Falha ao sincronizar com o banco. Por favor, tente novamente mais tarde.

# BankConnection.AuthExpired
source: Bank connection authorization has expired. Please reconnect.
pt_br: A autorizacao da conexao bancaria expirou. Por favor, reconecte.

source: Reconciliation not found
pt_br: Reconciliacao nao encontrada

# Reconciliation.AlreadyCompleted
source: This reconciliation has already been completed
pt_br: Esta reconciliacao ja foi concluida

# Reconciliation.BalanceMismatch
source: The calculated balance does not match the expected balance
pt_br: O saldo calculado nao corresponde ao saldo esperado
