Repository: digaomatias/mymascada
Catalog: src/WebAPI/MyMascada.WebAPI/Resources/Exceptions/ExceptionMessages.*.resx
Languages: pt_br

# RequiredInfoMissing
source: Required information is missing. Please provide all necessary data.
pt_br: Informacoes obrigatorias estao faltando. Por favor, forneca todos os dados necessarios.

# InvalidInput
source: Invalid input provided. Please check your request and try again.
pt_br: Entrada invalida fornecida. Por favor, verifique sua solicitacao e tente novamente.

# InvalidOperation
source: This operation is not valid in the current state.
pt_br: Esta operacao nao e valida no estado atual.

# Unauthorized
source: You are not authorized to perform this action.
pt_br: Voce nao esta autorizado a realizar esta acao.

# NotFound
source: The requested resource was not found.
pt_br: O recurso solicitado nao foi encontrado.

# Timeout
source: The request timed out. Please try again later.
pt_br: A solicitacao expirou. Por favor, tente novamente mais tarde.

# HighLoad
source: The system is currently experiencing high load. Please try again in a few moments.
pt_br: O sistema esta com alta demanda no momento. Por favor, tente novamente em alguns instantes.

# SystemError
source: A system error occurred. Please try again later.
pt_br: Ocorreu um erro no sistema. Por favor, tente novamente mais tarde.

# Unexpected
source: An unexpected error occurred. Our team has been notified.
pt_br: Ocorreu um erro inesperado. Nossa equipe foi notificada.

# ValidationFailed
source: Validation failed. Please check your input and try again.
pt_br: Falha na validacao. Por favor, verifique sua entrada e tente novamente.

# ConcurrencyConflict
source: The data was modified by another user. Please refresh and try again.
pt_br: Os dados foram modificados por outro usuario. Por favor, atualize e tente novamente.

# ServiceUnavailable
source: The service is temporarily unavailable. Please try again later.
pt_br: O servico esta temporariamente indisponivel. Por favor, tente novamente mais tarde.
